

let spot = {
    "id": "eu34mdp0oiaq",
    "parent": null,
    "name": "黄山风景区",
    "class": "scenic", //scenic:景区  spot:景点
    "alias": ["黄山"],
    "desc": "黄山,世界文化与自然双重遗产、世界地质公园、国家AAAAA级旅游景区、国家级风景名胜区、全国文明风景旅游区示范点。",
    "cover": "http://store.is.autonavi.com/showpic/d05de63ae9b99cd7dc9e1c47160d97c7",
    "theme": "自然风光",
    "address": "黄山市黄山区汤口镇",
    "scenic": {
        "star": 5,
        "qualify": ["黄山为国家级风景名胜区", "国家AAAAA级旅游景区", "国家地质公园", "爱国主义教育基地", "世界文化与自然双重遗产"],
        "special": ["摄影", "登山", "避暑", "温泉", "名山", '温泉', "奇峰怪石", "瀑布"],
        "peoples": ["学生", "个人", "情侣", "公司", "朋友", "亲子"],
        "districts": {
            "district": {
                "id": "c10ab9f7",
                "name": "黄山区",
                "adcode": "341003"
            },
            "city": {
                "id": "4a3d17c4",
                "name": "黄山市",
                "adcode": "341000"
            },
            "province": {
                "id": "12cea6f2",
                "name": "安徽省",
                "adcode": "340000"
            },
            "country": {
                "id": "c222ae14",
                "name": "中华人民共和国",
                "adcode": "100000"
            }
        }
    },

    "onmap": {
        "point": { "lon": "30.140751", "lat": "118.160515" },
        "shape": "116.607769,40.466069",
        "level": 13,
        "icon": null
    },
    "comment": {
        "score": 4.7,
        "recommend": "98%推荐",
        "total": 26341,
        "want": 3445633,
        "go": 3445,
        "tags": ["景色很美", "孩子很喜欢", "交通方便", "适合拍照"]
    },

    "infos": {
        "special": [
            "览黄山秋色处处胜景",
            "黄山,世界文化与自然双重遗产、世界地质公园、国家AAAAA级旅游景区、国家级风景名胜区、全国文明风景旅游区示范点。"
        ],
        "intro": "黄山,世界自然和文化双遗产,世界地质公园,中国十大名胜古迹之一,国家5A级旅游景区、国家级风景名胜区,位于安徽省南部黄山市境内(景区由市直辖),是安徽旅游的标志。黄山原名黟山,因峰岩青黑,遥望苍黛而名。后因传说轩辕黄帝曾在此炼丹,故改名为“黄山”。明朝旅行家徐霞客登临黄山时,曾对黄山的秀丽这样赞叹:“薄海内外之名山,无如徽之黄山。”后被当地人引伸为“五岳归来不看山,黄山归来不看岳”。",
        "guide": "黄山位于安徽省南部黄山市境内(景区由市直辖),是安徽旅游的标志,系中国十大风景名胜中唯一的山岳风光。黄山原名黟山,因峰岩青黑,遥望苍黛而名。后因传说轩辕黄帝曾在此炼丹,故改名为“黄山”。明朝旅行家徐霞客登临黄山时,曾对黄山的秀丽这样赞叹:“薄海内外之名山,无如徽之黄山。登黄山,天下无山,观止矣!”被后人引申为“五岳归来不看山,黄山归来不看岳”。"
    },
    "resource": [
        { "media": "image", "url": "http://store.is.autonavi.com/showpic/9fe53afb4475f714122a54445ec4734a" },
        { "media": "image", "url": "http://store.is.autonavi.com/showpic/d7057e273ac5b7869c3e529126428631" },
        { "media": "live", "url": "http://cache.amap.com/h5/h5/publish/523/index.html" }
    ],

    "external": {
        "baidu": { "id": "黄山风景区", "src": "https://baike.baidu.com/item/黄山风景区" },
        "baike": { "id": "黄山风景区", "src": "http://www.baike.com/gwiki/黄山风景区" },
        "amap": { "id": "B022F0071G", "src": "https://www.amap.com/detail/B022F0071G" },
        "ctrip": { "id": "64844", "src": "https://piao.ctrip.com/ticket/dest/t64844.html" },
        "mafengwo": { "id": "9602", "src": "http://www.mafengwo.cn/poi/9602.html" },
        "meet99": { "id": "anhuihuangshan", "src": "https://www.meet99.com/jingdian-anhuihuangshan.html" },
        "bytravel": { "id": "huangshan", "src": "http://www.bytravel.cn/Landscape/0/huangshan.html" },
        "dianping": { "id": "2224558", "url": "http://www.dianping.com/shop/2224558" }
    },

    "faqs": {
        "telephone": "0559-5561868",
        "website": "",
        "景区地图": "",
        "门票信息": "旺季(3月-11月):230元;淡季(12月-2月):150元",
        "开放时间": "1月21日-12月19日（旺季）  06:30-16:30；12月20日-次年1月20日（淡季）  07:00-16:30；云谷索道：周一至周五：07:00-17:00，周六、周日：06:30-17:00。玉屏索道：周一至周五：07:00-17:30，周六、周日：06:30-17:30。太平索道：周一至周五：07:00-17:00，周六、周日：06:30-17:00。西海观光缆车：08:00-17:00。节假日开放时间同周末。",
        "优待政策": [
            "儿童/老人/学生：6周岁（不含）至18周岁（含）的未成年人，凭本人有效身份证或户口簿原件；全日制本科及以下学生，凭本人有效学生证原件（7、8月份含本人当年中、高考准考证原件）的；60周岁（含）至65周岁（不含）的老年人，凭持本人有效身份证原件。【优待票】。",
            "儿童：有监护人陪同，持本人户口簿原件的6周岁（含）以下的儿童或身高1.2米（含）以下【免费】。",
            "老人：持本人身份证原件的65周岁（含）以上【免费】。",
            "残疾人：持国家相关部门颁发的残疾证原件的残疾人【免费】。",
            "军人：持本人士兵证或军官证原件的现役军人，退伍军人不参与【免费】。",
            "记者：持中华人民共和国新闻出版总署颁发的记者证原件的本人【免费】。",
            "旅行社总经理：持本人身份证原件和旅行社总经理资格证或旅行社总经理岗位职务培训证原件的本人【免费】。",
            "导游：持本人身份证和电子导游证原件的导游【免费】。",
            "持本人身份证件原件和境外冠名××国家（含港澳台地区）摄影家协会（不含其下设组织）、中国摄影家协会、省级摄影家协会(特指××省或直辖市摄影家协会)会员证原件的本人免票。\n黄山风景区对外籍人士无特殊优待政策。",
            "以上信息仅供参考，具体信息请以景区当天披露为准。",
        ],

        "用时信息": "建议游玩时长：1~3天",
        "入口信息": "黄山风景区景区有3个入口,各入口进入购买同一种大门票即可。入口地址如下:黄山市黄山区黄山风景区玉屏景区内，玉屏索道入口；黄山市黄山区黄山风景区云谷景区内，云谷索道入口 ；黄山市黄山区黄山风景区松谷景区内，太平索道入口。\n",
        "交通信息": "黄山市客运总站每天有多班班车前往汤口镇。到达后需乘坐黄山新国线前往景区，或建议自驾。",
        "游玩推荐": [
            "一日游:只有一天时间也可以玩黄山，不过行程紧张，建议后山上前山下（不需走回头路），上下山都乘索道，可能要选择不爬前山主峰（莲花峰/天都峰）或者不去西海大峡谷。",
            "两日游:景区游览分为前山、后山两条上山路线，都通向主峰之一光明顶，在光明顶的另一侧，还有一条环线-西海大峡谷。路线分为前山上后山下（前山-西海大峡谷-后山）和后山上前山下（后山-西海大峡谷-前山）。前山上后山下适合乘索道上山，步行下山，既轻松又不错过后半段精致的美景，不过因为西海大峡谷的最佳路线是从排云亭到天海（可以乘坐上山缆车），所以要走一段回头路。后山上前山下路线比较顺，后山适合步行观景，对体力要求较高，建议携带登山杖。",
        ],
        "观景佳处": [
            "看晚霞最佳地点：排云亭、丹霞峰、飞来石、光明顶、狮子峰。\n",
            "观日出最佳地点：清凉台、曙光亭、狮子峰、始信峰、丹霞峰、光明顶、鳌鱼峰、玉屏楼。\n",
            "看云海最佳地点：玉屏楼观前海、清凉台观后海、白鹅岭观东海、排云亭看西海、光明顶看天海。\n",
            "看雪景最佳地点：北海、西海、天海、玉屏楼、松谷、云谷和温泉。",
        ],
        "食宿建议": [
            "由于黄山的食物、日用品等都大多是通过挑山工们挑上山的，所以景区内物价较高。体力好的游客可在黄山脚下买些 方便食品带上山。如果想在山上吃一顿热腾腾的饭菜可以到酒店餐厅就餐，山顶快餐价格约50-120元/人。",
            "山上酒店主要有光明顶山庄和黄山旅游发展股份公司旗下的六家酒店（北海宾馆、狮林大酒店、西海饭店、排云楼宾馆、白云宾馆、玉屏楼宾馆）以及白鹅山庄。黄山接待量大，山上住宿酒店有限，所以要在黄山山上住宿的游客，一定要提前预定好酒店，另外景区酒店价格会根据淡季进行调整。"
        ],
        "园内交通": [
            "1、云谷索道：位于黄山风景区云谷寺，周一至周五 7:00--17:00；周六、周日 6:30--17:00，80元/人，下至云谷景区观云谷寺、上至北海景区白鹅岭，云谷索道可从黄山南大门进入后至云谷站乘坐。",
            "2、玉屏索道：位于黄山风景区慈光阁，下起温泉景区观瀑楼、上至玉屏景区蒲团松。",
            "3、太平索道：太平索道上站设在西海景区排云亭右侧的松林峰，下站设在松谷景区的松谷庵。",
            "4、西海大峡谷观光缆车：位于西海大峡谷南侧的的山谷内，下起排云溪，上至天海。",
        ],
        "温馨提示": [
            "旺季：1月21日—11月19日；淡季：11月20日—次年1月20日。 ",
            "黄山风景区单门票和索道票一张身份证一周（7天）限购（无论预订成功与否）5张。部分套票一张身份证（1天/7天）限购（无论预订成功与否）1/2张。以实际预定为准。",
            "黄山索道票不能通检，购票时请多留意！",
            "黄山风景区门票、索道票，一经取票，不退不换。",
            "黄山海拔高，自助取票机如有问题请至人工窗口取票。",
            "黄山门票二次入园的规则：游客自第一次入园开始，三天之内本人持票可第二次免费入园，全山通用。游客持票证（门票、身份证、手机二维码）第一次通过闸机检票时，系统摄像头会自动抓拍保存检票图像。游客在二次入园时，需向检票员出示相关票证调取出第一次入园图像，确认过本人后即可再次入园。以上信息仅供参考，具体情况请以景区当天披露为准（此规定不适用亲子一日游票、亲子两日游票及套票，敬请注意）。",
            "1、进入景区请勿采摘花草树木、乱刻乱画、敲打碑刻、破坏标识标牌等；\n2、请勿在登山途中违规吸烟和用火；\n3、请勿擅自进入未开发、开放景区；\n4、禁止携带任何松木及其制品进入景区，包括松木拐仗、松木旅游纪念品、红酒等松木包装箱（盒）等，如已带入，请及时联系活动组织人员，切勿擅自丢入林间；\n5、登山、游览期间，请做到“走路不看景，看景不走路”，沿途注意落石，确保自身安全；\n6、登山时，建议穿着登山鞋，若遇阴雨天气，请尽量使用雨衣；\n7、登山、游览途中，如遇猴群，切勿投食、嬉戏，更忌追赶、对视和挑逗，以防给您带来意外伤害；\n8、请将各类垃圾丢入垃圾池（箱），景区倡导并鼓励自带垃圾下山；\n9、未经管委会批准，景区内禁止放飞无人机；\n10、登山、游览期间，请大家相互礼让，不要拥挤，特别是在较为狭窄、游客众多的地段。\n11、以上信息仅供参考，具体请以景区当天披露为准。",
            "黄山景区游客爆满，出山时乘车要排队很久，建议不要赶在正中午或傍晚出山，适当提前以避开人群。\n山上气候多变，经常下雨，而且和山下温差很大，游玩时建议准备雨衣和御寒衣物。\n建议带一些食品上山，山上食物很贵。\n山顶有多家住宿地点，基本集中于光明顶天海、排云亭、白鹅岭、北海等几个区域。光明顶天海看日出最佳。\n",
        ],
        "foods": [
            { "rank": 1, "name": "毛豆腐", "intro": "虎皮毛豆腐又叫霉豆腐，曾入选《舌尖上的中国》。乍看之下，表面长毛的豆腐确实让人不敢下筷，与臭豆腐异曲同工，趁热吃到嘴里，鲜香回味。在路边小摊能吃到，在大小饭馆里也能尝到。", "img": "http://store.is.autonavi.com/showpic/f99642b7f680a3d76111a2b1e3831659" },
            { "rank": 2, "name": "臭鳜鱼", "intro": "臭鳜鱼是徽州臭鳜鱼徽州经典名菜，已有200 多年历史。臭鳜鱼最传统的做法就是红烧，烹好后色泽红亮，最大特点就是“臭”，第一次吃不一定能适应，如见榴莲或臭豆腐般；但闻着臭，吃起来却无比酥香，不少食客对其上瘾。在各大小饭馆均可吃到。", "img": "http://store.is.autonavi.com/showpic/f7919ebcedfd22ceba71398d389776cb" }
        ],

    }
}

/*
const fs = require('graceful-fs');
function write(name, data) {


    let file = `./cache/${name}.json`
    let op = {
        flag: 'w',
        encoding: 'utf8'
    }
    fs.writeFile(file, data, op, (err) => {
        if (err) throw err;
        console.log(`File [${file}] has been saved!`);
    });

}
let ctrip = require("../cache/ctrip.json").detailInfo
delete ctrip.ressHash
delete ctrip.shelfinfo
delete ctrip.headerinfo
delete ctrip.onlineservice
delete ctrip.ctriprecommend
delete ctrip.spotinfo.shelfgroupinfo

write("ctrip1", JSON.stringify(ctrip, null, 2))
console.log(1)
 */

 